lesson_5/todo/lib/events_stats.rb

    def events_for_each_user
      ordered_ids = User.order(:name).ids

      pre_output = ordered_ids.map do |id|
        [id, Event.where(user_id: id).ids]
---
SELECT "users"."id" FROM "users" ORDER BY "users"."name" ASC
SELECT "events"."id" FROM "events" WHERE "events"."user_id" = $1  [["user_id", 15]]

    def items_for_user_count(arr_with_events_id)
      items_in_each_event = Item.group(:event_id).count
---
SELECT COUNT(*) AS count_all, "items"."event_id" AS items_event_id FROM "items" GROUP BY "items"."event_id"

    def result
      pre_output = events_for_each_user.transform_values do |v|
        [v.size, items_for_user_count(v)]
      end

      pre_output = pre_output.transform_keys { |k| User.find(k).name }
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]